Chegou a hora de testar os conhecimentos desenvolvidos durante a aula.

Você é responsável por criar um banco de dados local de clientes para uma instituição financeira. Temos o arquivo CSV com os dados de clientes.

Sua missão é:

Criar o banco de dados local com a biblioteca SQLAlchemy.                      
Escrever os dados do arquivo CSV neste banco de dados local.                
Realizar três atualizações no banco de dados:               
Atualizar o registro do cliente de ID 6840104 que teve o rendimento anual alterado para 300000.              
Excluir o registro do cliente de ID 5008809, pois essa pessoa não possui mais conta na instituição financeira.              
Criar um novo registro de cliente seguindo as especificações abaixo:               
ID_Cliente: 6850985                  
Idade: 33               
Grau_escolaridade: Doutorado                       
Estado_civil: Solteiro               
Tamanho_familia: 1              
Categoria_de_renda: Empregado                   
Ocupacao: TI                   
Anos_empregado: 2                       
Rendimento_anual: 290000                
Tem_carro: 0                    
Moradia: Casa/apartamento próprio                    
Dica importante: Para adicionar um(a) novo(a) cliente à tabela, utilize a cláusula INSERT INTO seguida do nome da tabela e depois especifique entre parênteses os nomes das colunas da tabela. Utilize a cláusula VALUES e, em seguida, passe entre parênteses os novos valores para esse novo registro. Certifique-se de que os valores estejam na ordem correta e no formato adequado para cada coluna.

Vou usar o Microsoft SQL Server Management          
nome do servidor: DANIEL

In [14]:
from sqlalchemy.engine import URL
import pandas as pd
from sqlalchemy import create_engine, MetaData, Table, inspect

In [4]:
# link do arquivo csv para salvar dentro do banco sql

link = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/clientes_banco.csv'

In [27]:
from sqlalchemy import create_engine

# Substitua 'seu_host' e 'sua_base_de_dados' pelos seus próprios valores
host = 'DANIEL'
base_de_dados = 'CLIENTES_BANCO'

# Formato da URL de conexão para o SQL Server com autenticação do Windows
# 'mssql+pyodbc:///<dbname>?trusted_connection=yes&driver=ODBC+Driver+17+for+SQL+Server'
url_conexao = f'mssql+pyodbc:///{base_de_dados}?trusted_connection=yes&driver=ODBC+Driver+17+for+SQL+Server'

# Cria um objeto de engine usando a URL de conexão
engine = create_engine(url_conexao)

# Conecta ao banco de dados
conexao = engine.connect()

# Execute consultas SQL ou outras operações aqui

# Feche a conexão quando terminar
conexao.close()

In [20]:
# passando dados csv para um dataframe
dados = pd.read_csv(link)

In [33]:
# salvando dados csv dentro do sql server
dados.to_sql('Clientes_dados', engine, index=False)

-1

In [35]:
# para visualizar os dados

inspector = inspect(engine)
# essa função devolve os nomes que tem dentro do banco de dados
print(inspector.get_table_names())

['Clientes_dados', 'sysdiagrams']

In [36]:
# pd.read_sql('Clientes_dados',engine)

In [44]:
# fazendo consulta sql

query =  'SELECT * FROM "Clientes_dados"'

In [45]:
df_clientes = pd.read_sql(query,engine)

In [46]:
df_clientes.columns

Index(['ID_Cliente', 'Idade', 'Grau_escolaridade', 'Estado_civil',
       'Tamanho_familia', 'Categoria_de_renda', 'Ocupacao', 'Anos_empregado',
       'Rendimento_anual', 'Tem_carro', 'Moradia'],
      dtype='object')

In [49]:
df_clientes.query('ID_Cliente==6840104')

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
438458,6840104,62,Ensino médio,Divorciado,1,Pensionista,Outro,0,135000.0,0,Casa/apartamento próprio

In [50]:
# atualizando dados dentro do sql 
query ='UPDATE Clientes_dados SET Rendimento_anual = 300000 WHERE  ID_Cliente = 6840104'
# conecte para estabelecer uma conexão com o banco de dados
with engine.connect() as conn:
    conn.execute(query)

In [51]:
# visualizando tabela
ver = pd.read_sql_table('Clientes_dados',engine)

In [52]:
ver.query('ID_Cliente==6840104')

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
438458,6840104,62,Ensino médio,Divorciado,1,Pensionista,Outro,0,300000.0,0,Casa/apartamento próprio

In [57]:
# expluindo dados
query="DELETE FROM Clientes_dados WHERE ID_Cliente=5008809"
# conecte para estabelecer uma conexão com o banco de dados
with engine.connect() as conn:
    conn.execute(query)

In [60]:
#inserindo dados 

query = "INSERT INTO Clientes_dados Values(6850985,33,'Doutorado','Solteiro',1,'Empregado','TI',2,290000,0,'Casa/apartamento próprio')"
# conecte para estabelecer uma conexão com o banco de dados
with engine.connect() as conn:
    conn.execute(query)

In [61]:
# visualizando tabela
ver = pd.read_sql_table('Clientes_dados',engine)

In [62]:
# visualizando tabela
ver.query('ID_Cliente==6850985')

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
438462,6850985,33,Doutorado,Solteiro,1,Empregado,TI,2,290000.0,0,Casa/apartamento próprio